import type { t_全部数据映射, t_子分类, t_导航, t_导航和层级, t_文件夹, t_返回 } from "./类型";

const 数据类型 = new Set(["分类", "子分类", "文件夹", "导航"]);
const 图标类型 = new Set(["无", "图片", "文字"]);

export const fn基础属性校验 = (数据: t_导航和层级): t_返回<t_导航和层级> => {
  if (!("公开" in 数据) || typeof 数据.公开 !== "boolean") {
    return {
      状态: false,
      信息: `"公开" [${数据.公开}] 类型 [${typeof 数据.公开}] 不是布尔值`,
    };
  }

  if (!数据类型.has(数据.类型)) {
    return {
      状态: false,
      信息: `"类型" 的值 [${数据.类型}] 不允许`,
    };
  }

  if (!("父级ID" in 数据) || !Number.isInteger(数据.父级ID) || 数据.父级ID < 0) {
    return {
      状态: false,
      信息: `"父级ID" [${数据.父级ID}] 类型 [${typeof 数据.父级ID}] 不是整数`,
    };
  }

  if (数据.类型 === "分类" && 数据.父级ID !== 0) {
    return {
      状态: false,
      信息: `类型 "分类" 的父级 ID [${数据.父级ID}] 必须是数字 0`,
    };
  }

  if (数据.类型 !== "分类" && 数据.父级ID === 0) {
    return {
      状态: false,
      信息: `类型不是 "分类" 的父级 ID [${数据.父级ID}] 必须大于 0`,
    };
  }

  if (!("名称" in 数据) || typeof 数据.名称 !== "string") {
    return {
      状态: false,
      信息: `"名称" [${数据.名称}] 类型 [${typeof 数据.名称}] 不是字符串`,
    };
  }

  if (!("描述" in 数据) || typeof 数据.描述 !== "string") {
    return {
      状态: false,
      信息: `"描述" [${数据.描述}] 类型 [${typeof 数据.描述}] 不是字符串`,
    };
  }

  if (!("排序" in 数据) || !Number.isInteger(数据.排序) || 数据.排序 < 0) {
    return {
      状态: false,
      信息: `"排序" [${数据.排序}] 类型 [${typeof 数据.排序}] 不是整数`,
    };
  }

  if (!图标类型.has(数据.图标类型)) {
    return {
      状态: false,
      信息: `"图标类型" 的值 [${数据.图标类型}] 不允许`,
    };
  }

  if (
    "图标内容" in 数据 &&
    (typeof 数据.图标内容 !== "string" ||
      Array.from(new Intl.Segmenter().segment(数据.图标内容)).length > 1)
  ) {
    return {
      状态: false,
      信息: `"图标内容" 的值 [${数据.图标内容}] 不是一个字符或表情符号或为空`,
    };
  }

  if ("图标地址" in 数据 && typeof 数据.图标地址 !== "string") {
    return {
      状态: false,
      信息: `"图标地址" [${数据.图标地址}] 类型 [${typeof 数据.图标地址}] 不是字符串`,
    };
  }

  if (数据.图标类型 === "文字" && !("图标内容" in 数据)) {
    return {
      状态: false,
      信息: `"图标类型" 为 [文字] 时，"图标内容" 必须存在`,
    };
  }

  if (数据.图标类型 === "图片" && !("图标地址" in 数据)) {
    return {
      状态: false,
      信息: `"图标类型" 为 [图片] 时，"图标地址" 必须存在`,
    };
  }

  return { 状态: true, 内容: 数据 };
};

export const fn子分类校验 = (
  子分类: t_子分类,
  父级数据: t_导航和层级 | undefined,
): t_返回<t_子分类> => {
  if (!父级数据) {
    return { 状态: false, 信息: `"类型" [子分类] 的父级数据不存在` };
  }

  if (父级数据.类型 !== "分类") {
    return {
      状态: false,
      信息: `"类型" [子分类] 的父级类型 [${父级数据.类型}] 不是 "分类"`,
    };
  }

  return { 状态: true, 内容: 子分类 };
};

export const fn文件夹校验 = (
  文件夹: t_文件夹,
  父级数据: t_导航和层级 | undefined,
): t_返回<t_文件夹> => {
  if (!父级数据) {
    return { 状态: false, 信息: `"类型" 为 [文件夹] 的父级数据不存在` };
  }

  if (父级数据.类型 !== "子分类") {
    return {
      状态: false,
      信息: `"类型" [文件夹] 的父级类型 [${父级数据.类型}] 不是 "子分类"`,
    };
  }

  return { 状态: true, 内容: 文件夹 };
};

export const fn导航校验 = (导航: t_导航, 父级数据: t_导航和层级 | undefined): t_返回<t_导航> => {
  if (!父级数据) {
    return { 状态: false, 信息: `"类型" 为 [导航] 的父级数据不存在` };
  }

  if (父级数据.类型 !== "子分类" && 父级数据.类型 !== "文件夹") {
    return {
      状态: false,
      信息: `"类型" [导航] 的父级类型 [${父级数据.类型}] 不是 "子分类" 或 "文件夹"`,
    };
  }

  const 有内网 = "内网地址" in 导航;
  const 有外网 = "外网地址" in 导航;

  if (有内网 && typeof 导航.内网地址 !== "string") {
    return { 状态: false, 信息: `"类型" [导航] 的 "内网地址" 必须是字符串` };
  }
  if (有外网 && typeof 导航.外网地址 !== "string") {
    return { 状态: false, 信息: `"类型" [导航] 的 "外网地址" 必须是字符串` };
  }

  const 内网非空 = 有内网 && typeof 导航.内网地址 === "string" && 导航.内网地址.length > 0;
  const 外网非空 = 有外网 && typeof 导航.外网地址 === "string" && 导航.外网地址.length > 0;

  if (!内网非空 && !外网非空) {
    return { 状态: false, 信息: `"类型" [导航] 的 "内网地址" 和 "外网地址" 至少填写一个` };
  }

  return { 状态: true, 内容: 导航 };
};

export const fn校验所有数据 = (数据列表: t_导航和层级[]): t_返回<t_全部数据映射> => {
  const 已校验ID集合: Set<number> = new Set();
  const 数据转映射 = new Map(数据列表.map((项) => [项.ID, 项]));

  const 循环次数 = 数据列表.length;
  for (let 索引 = 0; 索引 < 循环次数; 索引++) {
    const 数据 = 数据列表[索引];

    const 信息前缀 = `${索引 + 1}/${循环次数} ID [${数据.ID}] [${数据.名称}] `;

    if (!Number.isInteger(数据.ID) || 数据.ID <= 0) {
      return { 状态: false, 信息: 信息前缀 + `ID 类型 [${typeof 数据.ID}] 不是正整数` };
    }

    if (已校验ID集合.has(数据.ID)) {
      return { 状态: false, 信息: 信息前缀 + ` ID 重复` };
    }

    const 基础属性校验 = fn基础属性校验(数据);
    if (!基础属性校验.状态) {
      return { 状态: false, 信息: 信息前缀 + `${基础属性校验.信息}` };
    }

    if (数据.类型 === "子分类") {
      const 子分类校验 = fn子分类校验(数据, 数据转映射.get(数据.父级ID));
      if (!子分类校验.状态) {
        return { 状态: false, 信息: 信息前缀 + `${子分类校验.信息}` };
      }
    }

    if (数据.类型 === "文件夹") {
      const 文件夹校验 = fn文件夹校验(数据, 数据转映射.get(数据.父级ID));
      if (!文件夹校验.状态) {
        return { 状态: false, 信息: 信息前缀 + `${文件夹校验.信息}` };
      }
    }

    if (数据.类型 === "导航") {
      const 导航校验 = fn导航校验(数据, 数据转映射.get(数据.父级ID));
      if (!导航校验.状态) {
        return { 状态: false, 信息: 信息前缀 + `${导航校验.信息}` };
      }
    }

    已校验ID集合.add(数据.ID);
  }

  return { 状态: true, 内容: 数据转映射 };
};
