import {
  t_基础信息,
  t_所有类型,
  t_返回,
  t_图标,
  t_导航,
  t_导航和层级,
  t_子分类,
  t_文件夹,
} from "./类型";
import { fn字符串校验 } from "./常用工具";

const 层级字段 = new Set([
  "公开",
  "类型",
  "ID",
  "父级ID",
  "排序",
  "名称",
  "描述",
  "图标类型",
  "图标地址",
  "图标内容",
]);
const 可更新层级字段 = new Set([...层级字段].filter((字段) => !new Set(["类型", "ID"]).has(字段)));

const 导航字段 = new Set([...层级字段, "内网地址", "外网地址"]);
const 可更导航级字段 = new Set([...导航字段].filter((字段) => !new Set(["类型", "ID"]).has(字段)));

const 数据类型 = new Set(["分类", "子分类", "文件夹", "导航"]);

const 图标类型 = new Set(["无", "图片", "文字"]);

/**
 * 校验数据的[属性]是否正确
 * @参数 待校验数据
 * @返回 { 状态: 布尔值, 信息: 错误原因 }
 */
export const fn初步属性校验 = (
  类型: t_所有类型,
  待校验数据: any | t_基础信息<t_所有类型> | t_导航,
): t_返回 => {
  if (Object.prototype.toString.call(待校验数据) !== "[object Object]") {
    return { 状态: false, 信息: "不是对象格式" };
  }

  const 属性集合 = new Set(Object.keys(待校验数据));
  for (const 必须属性 of 层级字段) {
    if (必须属性 === "描述" || 必须属性 === "图标地址" || 必须属性 === "图标内容") continue;
    if (!属性集合.has(必须属性)) {
      return { 状态: false, 信息: `${类型} 数据中缺少属性 "${必须属性}"` };
    }
  }

  if (类型 !== 待校验数据.类型) {
    return {
      状态: false,
      信息: `ID 为 ${待校验数据.ID || "-"} 的数据类型 "${待校验数据.类型 || "-"}" 不是 "${类型}"`,
    };
  }

  if (待校验数据.图标类型 === "文字" && !("图标内容" in 待校验数据)) {
    return {
      状态: false,
      信息: `ID 为 ${待校验数据.ID || "-"} 类型 ${待校验数据.类型 || "-"} "图标类型" 为 "文字" 时，"图标内容" 必填`,
    };
  }

  if (待校验数据.图标类型 === "图片" && !("图标地址" in 待校验数据)) {
    return {
      状态: false,
      信息: `ID 为 ${待校验数据.ID || "-"} 类型 ${待校验数据.类型 || "-"} "图标类型" 为 "图片" 时，"图标地址" 必填`,
    };
  }

  if (类型 === "导航" && !("内网地址" in 待校验数据) && !("外网地址" in 待校验数据)) {
    return {
      状态: false,
      信息: `ID ${待校验数据.ID || "-"} "类型" 为 "导航" 时 "内网地址" 和 "外网地址" 不能同时为空`,
    };
  }

  if (类型 === "导航") {
    for (const 键 in 待校验数据) {
      if (!导航字段.has(键))
        return { 状态: false, 信息: `ID ${待校验数据.ID || "-"} 存在未知属性 "${键}"` };
    }
  } else {
    for (const 键 in 待校验数据) {
      if (!层级字段.has(键))
        return { 状态: false, 信息: `ID ${待校验数据.ID || "-"} 存在未知属性 "${键}"` };
    }
  }

  return { 状态: true, 内容: "" };
};

/**
 * 校验数据的[属性值]是否符符合定义格式
 * @参数 待校验数据
 * @返回 { 状态: 布尔值, 信息: 错误原因 }
 */
export const fn初步属性值校验 = (待校验数据: t_基础信息<t_所有类型> | t_导航): t_返回 => {
  if (typeof 待校验数据.公开 !== "boolean") {
    return { 状态: false, 信息: `ID ${待校验数据.ID} "公开" "${待校验数据.公开}" 属性不是布尔值` };
  }

  if (!Number.isInteger(待校验数据.ID) || 待校验数据.ID <= 0) {
    return { 状态: false, 信息: `"ID" "${待校验数据.ID}" 不是正整数` };
  }

  if (!Number.isInteger(待校验数据.父级ID) || 待校验数据.父级ID < 0) {
    return { 状态: false, 信息: `ID ${待校验数据.ID} "父级ID" "${待校验数据.父级ID}" 不是正整数` };
  }

  if (!Number.isInteger(待校验数据.排序) || 待校验数据.排序 <= 0) {
    return { 状态: false, 信息: `ID ${待校验数据.ID} "排序" "${待校验数据.排序}" 不是正整数` };
  }

  if (!fn字符串校验(待校验数据.名称, { 最小长度: 2 })) {
    return {
      状态: false,
      信息: `ID ${待校验数据.ID} "名称" "${待校验数据.名称}" 不是非空长度大于 1 的字符串`,
    };
  }

  if ("描述" in 待校验数据 && !fn字符串校验(待校验数据.描述, { 首尾空格: true, 中间空格: true })) {
    return { 状态: false, 信息: `ID ${待校验数据.ID} "描述" "${待校验数据.描述}" 不是字符串` };
  }

  if (!图标类型.has(待校验数据.图标类型)) {
    return {
      状态: false,
      信息: `ID 为 ${待校验数据.ID} 类型 ${待校验数据.类型} "图标类型" "${待校验数据.图标类型}" 只能是 ${图标类型} 中的一个`,
    };
  }

  if ("图标内容" in 待校验数据 && !fn字符串校验(待校验数据.图标内容, { 最小长度: 1 })) {
    return {
      状态: false,
      信息: `ID 为 ${待校验数据.ID} 类型 ${待校验数据.类型} "图标内容" "${待校验数据.图标内容}" 存在时，必须是非空字符`,
    };
  }

  if (
    "图标地址" in 待校验数据 &&
    !/^(https?:\/\/|[1-9]\d{12,}-)/.test(待校验数据?.图标地址 ?? "")
  ) {
    return {
      状态: false,
      信息: `ID 为 ${待校验数据.ID} 类型 ${待校验数据.类型} "图标地址" ${待校验数据.图标地址} 存在时，必须是网址或 "时间戳-" 开头的本地图片`,
    };
  }

  if ("内网地址" in 待校验数据 && !fn字符串校验(待校验数据.内网地址)) {
    return { 状态: false, 信息: `ID ${待校验数据.ID} "内网地址" 必须是字符串` };
  }
  if ("外网地址" in 待校验数据 && !fn字符串校验(待校验数据.外网地址)) {
    return { 状态: false, 信息: `ID ${待校验数据.ID} "外网地址" 必须是字符串` };
  }

  if (待校验数据.类型 === "导航") {
    if (!待校验数据.内网地址 && !待校验数据.外网地址) {
      return { 状态: false, 信息: `ID ${待校验数据.ID} "内网地址" 和 "外网地址" 不能同时为空` };
    }
  }

  return { 状态: true, 内容: "" };
};

/**
 * 校验需要更新的内容[属性]是否正确
 * @参数 待校验数据
 * @返回 { 状态: 布尔值, 信息: 错误原因 }
 */
export const fn更新初步属性校验 = <T extends t_所有类型>(
  类型: t_所有类型,
  待校验数据: any | t_基础信息<T> | t_导航,
): t_返回 => {
  if (Object.prototype.toString.call(待校验数据) !== "[object Object]") {
    return { 状态: false, 信息: "不是对象格式" };
  }

  if (类型 === "导航") {
    for (const 键 in 待校验数据) {
      if (!可更导航级字段.has(键)) return { 状态: false, 信息: `存在未知属性 "${键}"` };
    }
    return { 状态: true, 内容: "" };
  }

  for (const 键 in 待校验数据) {
    if (!可更新层级字段.has(键)) return { 状态: false, 信息: `存在未知属性 "${键}"` };
  }
  return { 状态: true, 内容: "" };
};

export const fn更新初步属性值校验 = <T extends t_所有类型>(
  待校验数据: any | t_基础信息<T> | t_导航,
): t_返回 => {
  if ("公开" in 待校验数据 && typeof 待校验数据.公开 !== "boolean") {
    return {
      状态: false,
      信息: `属性 "公开" "${待校验数据.公开}" 不是布尔值`,
    };
  }

  if ("父级ID" in 待校验数据 && (!Number.isInteger(待校验数据.父级ID) || 待校验数据.父级ID <= 0)) {
    return {
      状态: false,
      信息: `属性 "父级ID" "${待校验数据.父级ID}" 不是正整数`,
    };
  }

  if ("排序" in 待校验数据 && (!Number.isInteger(待校验数据.排序) || 待校验数据.排序 <= 0)) {
    return {
      状态: false,
      信息: `属性 "排序" "${待校验数据.排序}" 不是正整数`,
    };
  }

  if ("名称" in 待校验数据 && !fn字符串校验(待校验数据.名称, { 最小长度: 2 })) {
    return {
      状态: false,
      信息: `属性 "名称" "${待校验数据.名称}" 不是非空长度大于 1 的字符串`,
    };
  }

  if ("描述" in 待校验数据 && !fn字符串校验(待校验数据.描述, { 首尾空格: true, 中间空格: true })) {
    return {
      状态: false,
      信息: `属性 "描述" "${待校验数据.描述}" 不是字符串`,
    };
  }

  if ("图标类型" in 待校验数据 && !图标类型.has(待校验数据.图标类型)) {
    return {
      状态: false,
      信息: `属性 "图标类型" "${待校验数据.图标类型}" 只能是 ${图标类型} 中的一个`,
    };
  }

  if ("图标内容" in 待校验数据 && !fn字符串校验(待校验数据.图标内容, { 最小长度: 1 })) {
    return {
      状态: false,
      信息: `属性 "图标内容" "${待校验数据.图标内容}" 存在时，必须是非空字符串`,
    };
  }

  if (
    "图标地址" in 待校验数据 &&
    !/^(https?:\/\/|[1-9]\d{12,}-)/.test(待校验数据?.图标地址 ?? "")
  ) {
    return {
      状态: false,
      信息: `属性 "图标地址" ${待校验数据.图标地址} 存在时，必须是网址或 "时间戳-" 开头的本地图片`,
    };
  }

  if (待校验数据.图标类型 === "文字" && !("图标内容" in 待校验数据)) {
    return {
      状态: false,
      // @ts-ignore
      信息: `属性 "图标类型" 为 "文字" 时，"图标内容" 必填`,
    };
  }

  if (待校验数据.图标类型 === "图片" && !("图标地址" in 待校验数据)) {
    return {
      状态: false,
      // @ts-ignore
      信息: `属性 "图标类型" 为 "图片" 时，"图标地址" 必填`,
    };
  }

  if ("内网地址" in 待校验数据 && !fn字符串校验(待校验数据.内网地址)) {
    return {
      状态: false,
      信息: `属性 "内网地址" 必须是字符串`,
    };
  }
  if ("外网地址" in 待校验数据 && !fn字符串校验(待校验数据.外网地址)) {
    return {
      状态: false,
      信息: `属性 "外网地址" 必须是字符串`,
    };
  }

  return { 状态: true, 内容: "" };
};

export const fn校验子分类 = (所有数据: t_导航和层级[], 子分类: t_子分类): t_返回 => {
  const 属性校验 = fn初步属性校验("子分类", 子分类);
  if (!属性校验.状态) return 属性校验;

  const 属性值校验 = fn初步属性值校验(子分类);
  if (!属性值校验.状态) return 属性值校验;

  const 所属分类 = 所有数据.find((元素) => 元素.ID === 子分类.父级ID);
  if (!所属分类) {
    return { 状态: false, 信息: `ID为 ${子分类.ID} 的 子分类 所属的分类不存在` };
  }
  if (所属分类.类型 !== "分类") {
    return {
      状态: false,
      信息: `ID为 ${子分类.ID} 的 子分类 父级 ID ${所属分类.ID} 类型 ${所属分类.类型} 不是 "分类"`,
    };
  }
  return { 状态: true, 内容: "" };
};

export const fn校验文件夹 = (所有数据: t_导航和层级[], 文件夹: t_文件夹): t_返回 => {
  const 属性校验 = fn初步属性校验("文件夹", 文件夹);
  if (!属性校验.状态) return 属性校验;

  const 属性值校验 = fn初步属性值校验(文件夹);
  if (!属性值校验.状态) return 属性值校验;

  const 所属子分类 = 所有数据.find((元素) => 元素.ID === 文件夹.父级ID) as t_子分类 | undefined;
  if (!所属子分类) {
    return { 状态: false, 信息: `ID为 ${文件夹.ID} 的 文件夹 所属的子分类不存在` };
  }
  if (所属子分类.类型 !== "子分类") {
    return {
      状态: false,
      信息: `ID为 ${文件夹.ID} 的 文件夹 父级 ID ${所属子分类.ID} 类型 ${所属子分类.类型} 不是 "子分类"`,
    };
  }

  const 所属子分类校验 = fn校验子分类(所有数据, 所属子分类);

  if (!所属子分类校验.状态) {
    return {
      状态: false,
      信息: `ID为 ${文件夹.ID} 的 文件夹 所属的\n  ${所属子分类校验.信息}`,
    };
  }

  return { 状态: true, 内容: "" };
};

export const fn校验导航 = (所有数据: t_导航和层级[], 导航: t_导航): t_返回 => {
  const 属性校验 = fn初步属性校验("导航", 导航);
  if (!属性校验.状态) return 属性校验;

  const 属性值校验 = fn初步属性值校验(导航);
  if (!属性值校验.状态) return 属性值校验;

  const 所属父级 = 所有数据.find((元素) => 元素.ID === 导航.父级ID) as
    | t_子分类
    | t_文件夹
    | undefined;
  if (!所属父级) {
    return { 状态: false, 信息: `ID为 ${导航.ID} 的 导航 父级不存在` };
  }
  if (所属父级.类型 !== "子分类" && 所属父级.类型 !== "文件夹") {
    return {
      状态: false,
      // @ts-ignore
      信息: `ID为 ${导航.ID} 的 导航 父级 ID ${所属父级.ID} 类型 ${所属父级.类型} 不是 "子分类" 或 "文件夹"`,
    };
  }

  if (所属父级.类型 === "子分类") {
    const 所属子分类校验 = fn校验子分类(所有数据, 所属父级);

    if (!所属子分类校验.状态) {
      return { 状态: false, 信息: `ID为 ${导航.ID} 的 导航 所属的\n  ${所属子分类校验.信息}` };
    }

    return { 状态: true, 内容: "" };
  }

  const 所属文件夹校验 = fn校验文件夹(所有数据, 所属父级);

  if (!所属文件夹校验.状态) {
    return { 状态: false, 信息: `ID为 ${导航.ID} 的 导航 所属的\n  ${所属文件夹校验.信息}` };
  }

  return { 状态: true, 内容: "" };
};

export const fn校验所有数据 = (导航数据列表: t_导航和层级[]): t_返回 => {
  const 已校验ID集合: Set<number> = new Set();
  for (let 索引 = 0; 索引 < 导航数据列表.length; 索引++) {
    const 导航数据 = 导航数据列表[索引];
    if (!数据类型.has(导航数据.类型)) {
      return {
        状态: false,
        信息: `第 ${索引 + 1} 个 ID 为 ${导航数据.ID} 类型 ${导航数据.类型} 不合规`,
      };
    }
    if (已校验ID集合.has(导航数据.ID)) {
      return { 状态: false, 信息: `第 ${索引 + 1} 个 ID 为 ${导航数据.ID} 的 ID 重复` };
    }
    if (导航数据.类型 === "分类") {
      if (导航数据.父级ID !== 0) {
        return {
          状态: false,
          信息: `第 ${索引 + 1} 个 ID 为 ${导航数据.ID} 的 分类 的父级ID 不合规，分类的父级ID只能为 0`,
        };
      }
      const 属性校验 = fn初步属性校验("分类", 导航数据);
      if (!属性校验.状态) return 属性校验;

      const 属性值校验 = fn初步属性值校验(导航数据);
      if (!属性值校验.状态) return 属性值校验;
    }
    if (导航数据.类型 === "子分类") {
      const 子分类校验结果 = fn校验子分类(导航数据列表, 导航数据);
      if (!子分类校验结果.状态) return 子分类校验结果;
    }
    if (导航数据.类型 === "文件夹") {
      const 文件夹校验结果 = fn校验文件夹(导航数据列表, 导航数据);
      if (!文件夹校验结果.状态) return 文件夹校验结果;
    }
    if (导航数据.类型 === "导航") {
      const 导航校验结果 = fn校验导航(导航数据列表, 导航数据);
      if (!导航校验结果.状态) return 导航校验结果;
    }

    已校验ID集合.add(导航数据.ID);
  }
  return { 状态: true, 内容: "" };
};

export const fnID校验_分类 = (导航数据列表: t_导航和层级[], ID: number): t_返回 => {
  const 分类数据 = 导航数据列表.find((元素) => 元素.ID === ID);
  if (!分类数据) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 分类 不存在` };
  }
  if (分类数据.类型 !== "分类") {
    return { 状态: false, 信息: `ID 为 ${ID} 的 数据 类型 ${分类数据.类型} 不是 "分类"` };
  }
  return { 状态: true, 内容: "" };
};

export const fnID校验_子分类 = (导航数据列表: t_导航和层级[], ID: number): t_返回 => {
  const 子分类数据 = 导航数据列表.find((元素) => 元素.ID === ID);
  if (!子分类数据) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 子分类 不存在` };
  }
  if (子分类数据.类型 !== "子分类") {
    return { 状态: false, 信息: `ID 为 ${ID} 的 数据 类型 ${子分类数据.类型} 不是 "子分类"` };
  }

  const 父级ID校验 = fnID校验_分类(导航数据列表, 子分类数据.父级ID);
  if (!父级ID校验.状态) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 子分类 父级：\n  ${父级ID校验.信息}` };
  }

  return { 状态: true, 内容: "" };
};

export const fnID校验_文件夹 = (导航数据列表: t_导航和层级[], ID: number): t_返回 => {
  const 文件夹数据 = 导航数据列表.find((元素) => 元素.ID === ID);
  if (!文件夹数据) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 文件夹 不存在` };
  }
  if (文件夹数据.类型 !== "文件夹") {
    return { 状态: false, 信息: `ID 为 ${ID} 的 数据 类型 ${文件夹数据.类型} 不是 "文件夹"` };
  }

  const 父级ID校验 = fnID校验_子分类(导航数据列表, 文件夹数据.父级ID);
  if (!父级ID校验.状态) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 文件夹 父级：\n  ${父级ID校验.信息}` };
  }

  return { 状态: true, 内容: "" };
};

export const fnID校验_子分类导航 = (导航数据列表: t_导航和层级[], ID: number): t_返回 => {
  const 子分类导航数据 = 导航数据列表.find((元素) => 元素.ID === ID);
  if (!子分类导航数据) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 子分类导航 不存在` };
  }
  if (子分类导航数据.类型 !== "导航") {
    return { 状态: false, 信息: `ID 为 ${ID} 的 数据 类型 ${子分类导航数据.类型} 不是 "导航"` };
  }

  const 父级ID校验 = fnID校验_子分类(导航数据列表, 子分类导航数据.父级ID);
  if (!父级ID校验.状态) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 子分类导航 父级：\n  ${父级ID校验.信息}` };
  }

  return { 状态: true, 内容: "" };
};

export const fnID校验_文件夹导航 = (导航数据列表: t_导航和层级[], ID: number): t_返回 => {
  const 文件夹导航数据 = 导航数据列表.find((元素) => 元素.ID === ID);
  if (!文件夹导航数据) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 文件夹导航 不存在` };
  }
  if (文件夹导航数据.类型 !== "导航") {
    return { 状态: false, 信息: `ID 为 ${ID} 的 数据 类型 ${文件夹导航数据.类型} 不是 "导航"` };
  }

  const 父级ID校验 = fnID校验_文件夹(导航数据列表, 文件夹导航数据.父级ID);
  if (!父级ID校验.状态) {
    return { 状态: false, 信息: `ID 为 ${ID} 的 文件夹导航 父级：\n  ${父级ID校验.信息}` };
  }

  return { 状态: true, 内容: "" };
};
