import type { t_层级 } from "@公共代码/类型";
import type { t_层级信息 } from "../类型";
import { cmp_数据格式化 } from "../全局共享数据";
import { 默认值_信息共有 } from "./默认值";

export const fn层级数据转信息 = <T extends t_层级>(数据: T): t_层级信息<T> => {
  let 返回数据 = {
    ...数据,
    ...默认值_信息共有,
  };

  const 层级内容列表 = cmp_数据格式化.value.Map_层级数据.get(数据.ID);
  if (!层级内容列表) return 返回数据;

  返回数据.子内容数量 = 层级内容列表.length;

  返回数据.子内容公开数量 = 层级内容列表.filter((内容) => 内容.公开).length;
  返回数据.子内容私有数量 = 返回数据.子内容数量 - 返回数据.子内容公开数量;

  if (数据.类型 === "子分类") {
    返回数据.子分类中导航数量 = 层级内容列表.filter((内容) => 内容.类型 === "导航").length;
    返回数据.子分类中文件夹数量 = 返回数据.子内容数量 - 返回数据.子分类中导航数量;
  }

  return 返回数据;
};
