import { readFileSync, writeFileSync } from "node:fs";
import { const_数据目录 } from "../配置读取";
import { t_账号设置 } from "@公共代码/类型";
import { fn字符串校验 } from "../工具/常用校验";
import fn创建日志实例 from "../工具/日志";

const log = fn创建日志实例("数据/账号设置");

const 本地账号设置: t_账号设置 = JSON.parse(readFileSync(const_数据目录.账号设置, "utf-8"));

const 最终账号设置: t_账号设置 = {
  用户名: "",
  密码: "",
  JWT_密钥: "",
  过期时间: 1,
  普通凭据登录数量: 1,
  超长凭据过期时间: 1,
  超长凭据登录数量: 1,
};

if (fn字符串校验(本地账号设置.用户名, { 最小长度: 3 })) {
  最终账号设置.用户名 = 本地账号设置.用户名;
  log.debug(`用户名 ${本地账号设置.用户名}`);
} else {
  throw new Error(
    `配置文件 ${const_数据目录.账号设置} 用户名 格式错误,只能是无空格长度大于等于 3 的字符串`,
  );
}

if (fn字符串校验(本地账号设置.密码, { 最小长度: 3 })) {
  最终账号设置.密码 = 本地账号设置.密码;
  log.debug(`密码 ${本地账号设置.密码}`);
} else {
  throw new Error(
    `配置文件 ${const_数据目录.账号设置} 密码 格式错误,只能是无空格长度大于等于 3 的字符串`,
  );
}

if (fn字符串校验(本地账号设置.JWT_密钥, { 最小长度: 10 })) {
  最终账号设置.JWT_密钥 = 本地账号设置.JWT_密钥;
  log.debug(`JWT_密钥 ${本地账号设置.JWT_密钥}`);
} else {
  throw new Error(
    `配置文件 ${const_数据目录.账号设置} JWT_密钥 格式错误,只能是无空格长度大于等于 10 的字符串`,
  );
}

if ("长期登录秘钥" in 本地账号设置) {
  if (fn字符串校验(本地账号设置.长期登录秘钥, { 最小长度: 3 })) {
    最终账号设置.长期登录秘钥 = 本地账号设置.长期登录秘钥;
    log.debug(`长期登录秘钥 ${本地账号设置.长期登录秘钥}`);
  } else {
    throw new Error(
      `配置文件 ${const_数据目录.账号设置} 长期登录秘钥 格式错误,只能是无空格长度大于等于 3 的字符串`,
    );
  }
}

if (
  "过期时间" in 本地账号设置 &&
  typeof 本地账号设置.过期时间 === "number" &&
  Number.isInteger(本地账号设置.过期时间) &&
  本地账号设置.过期时间 > 0
) {
  最终账号设置.过期时间 = 本地账号设置.过期时间;
  log.debug(`过期时间 ${本地账号设置.过期时间} 天`);
} else {
  throw new Error(`配置文件 ${const_数据目录.账号设置} 过期时间 格式错误,只能是大于 0 的正整数`);
}

if (
  "普通凭据登录数量" in 本地账号设置 &&
  typeof 本地账号设置.普通凭据登录数量 === "number" &&
  Number.isInteger(本地账号设置.普通凭据登录数量) &&
  本地账号设置.普通凭据登录数量 > 0
) {
  最终账号设置.普通凭据登录数量 = 本地账号设置.普通凭据登录数量;
  log.debug(`普通凭据同时登录设备最多数量 ${本地账号设置.普通凭据登录数量} 个`);
} else {
  throw new Error(
    `配置文件 ${const_数据目录.账号设置} 普通凭据登录数量 格式错误,只能是大于 0 的正整数`,
  );
}

if (
  "超长凭据过期时间" in 本地账号设置 &&
  typeof 本地账号设置.超长凭据过期时间 === "number" &&
  Number.isInteger(本地账号设置.超长凭据过期时间) &&
  本地账号设置.超长凭据过期时间 > 0
) {
  最终账号设置.超长凭据过期时间 = 本地账号设置.超长凭据过期时间;
  log.debug(`超长凭据过期时间 ${本地账号设置.超长凭据过期时间} 天`);
} else {
  throw new Error(
    `配置文件 ${const_数据目录.账号设置} 超长凭据过期时间 格式错误,只能是大于 0 的正整数`,
  );
}

if (
  "超长凭据登录数量" in 本地账号设置 &&
  typeof 本地账号设置.超长凭据登录数量 === "number" &&
  Number.isInteger(本地账号设置.超长凭据登录数量) &&
  本地账号设置.超长凭据登录数量 > 0
) {
  最终账号设置.超长凭据登录数量 = 本地账号设置.超长凭据登录数量;
  log.debug(`超长凭据同时登录设备最多数量 ${本地账号设置.超长凭据登录数量} 天`);
} else {
  throw new Error(
    `配置文件 ${const_数据目录.账号设置} 超长凭据登录数量 格式错误,只能是大于 0 的正整数`,
  );
}

export const const_账号设置 = Object.freeze(最终账号设置);
